<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [Gtk-sharp-list] progressbar on a treeview
   </TITLE>
   <LINK REL="Index" HREF="index.html" >
   <LINK REL="made" HREF="mailto:gtk-sharp-list%40lists.ximian.com?Subject=Re%3A%20%5BGtk-sharp-list%5D%20progressbar%20on%20a%20treeview&In-Reply-To=%3C1450432981062-4667185.post%40n4.nabble.com%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="011556.html">
   <LINK REL="Next"  HREF="011558.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Gtk-sharp-list] progressbar on a treeview</H1>
    <B>Andrey Gankov</B> 
    <A HREF="mailto:gtk-sharp-list%40lists.ximian.com?Subject=Re%3A%20%5BGtk-sharp-list%5D%20progressbar%20on%20a%20treeview&In-Reply-To=%3C1450432981062-4667185.post%40n4.nabble.com%3E"
       TITLE="[Gtk-sharp-list] progressbar on a treeview">gankov.andrey at inbox.ru
       </A><BR>
    <I>Fri Dec 18 10:03:01 UTC 2015</I>
    <P><UL>
        <LI>Previous message: <A HREF="011556.html">[Gtk-sharp-list] progressbar on a treeview
</A></li>
        <LI>Next message: <A HREF="011558.html">[Gtk-sharp-list] progressbar on a treeview
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#11557">[ date ]</a>
              <a href="thread.html#11557">[ thread ]</a>
              <a href="subject.html#11557">[ subject ]</a>
              <a href="author.html#11557">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>&#1042;&#1090;&#1086;&#1088;&#1086;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;.

&#1054;&#1085; &#1074;&#1099;&#1075;&#1086;&#1076;&#1085;&#1077;&#1077; &#1077;&#1089;&#1083;&#1080; &#1091; &#1090;&#1077;&#1073;&#1103; &#1074; &#1082;&#1086;&#1083;&#1086;&#1085;&#1082;&#1077; 2, &#1075;&#1076;&#1077; &#1090;&#1080;&#1087; object &#1083;&#1077;&#1078;&#1080;&#1090; &#1082;&#1072;&#1082;&#1086;&#1081; &#1090;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1086;&#1086;&#1073;&#1097;&#1080;&#1090;&#1100; &#1087;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1077;&#1089;&#1089;. &#1048;&#1083;&#1080; &#1090;&#1099; &#1093;&#1086;&#1095;&#1077;&#1096;&#1100; &#1095;&#1090;&#1086; &#1090;&#1086; &#1089;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1085;&#1072; &#1083;&#1077;&#1090;&#1091;,
&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1090;&#1100; &#1087;&#1088;&#1086;&#1075;&#1088;&#1077;&#1089;&#1089;.

//&#1050;&#1086;&#1083;&#1086;&#1085;&#1082;&#1091; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1086;&#1079;&#1072;&#1090;&#1100; &#1086;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1086;&#1081;
treeview1.AppendColumn (&quot;&#1057;&#1090;&#1072;&#1090;&#1091;&#1089;&quot;, new Gtk.CellRendererProgress (),
StatusCellDataFuc);

//&#1057;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1089;&#1072;&#1084;&#1072; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;
	private void StatusCellDataFuc (Gtk.TreeViewColumn column, Gtk.CellRenderer
cell, Gtk.TreeModel model, Gtk.TreeIter iter)
	{
		//&#1052;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; &#1082;&#1072;&#1082;&#1080;&#1077; &#1090;&#1086; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1080;&#1079; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;(ListStore)
                int curentPosition = (int) model.GetValue (iter, ??);
                //&#1048; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1080;&#1093; &#1088;&#1077;&#1085;&#1076;&#1077;&#1088;&#1091;. &#1053;&#1091;&#1078;&#1085;&#1086; &#1091;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100; &#1095;&#1090;&#1086; &#1101;&#1090;&#1086; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1073;&#1091;&#1076;&#1077;&#1090;
&#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1074;&#1089;&#1103;&#1082;&#1080;&#1081; &#1088;&#1072;&#1079; &#1082;&#1086;&#1075;&#1076;&#1072; treeview &#1079;&#1072;&#1093;&#1086;&#1095;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1090;&#1100; &#1103;&#1095;&#1077;&#1082;&#1091;. &#1058;&#1099; &#1084;&#1086;&#1078;&#1077;&#1096;&#1100;
&#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1085;&#1072;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1088;&#1077;&#1085;&#1076;&#1077;&#1088;&#1072;.
               int pencent = (curentPosition / total) * 100;
               (cell as Gtk.CellRendererProgress).Value = pencent;
               (cell as Gtk.CellRendererProgress).Text =
String.Format(&quot;{0}%&quot;, percent);
	}

&#1058;&#1091;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1080;&#1079; &#1076;&#1088;&#1091;&#1075;&#1086;&#1075;&#1086; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072; &#1085;&#1091;&#1078;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1082;&#1072;&#1082; &#1090;&#1086; &#1079;&#1072;&#1090;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100;
treeview &#1087;&#1077;&#1088;&#1077;&#1088;&#1080;&#1089;&#1086;&#1074;&#1099;&#1074;&#1072;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;. &#1045;&#1089;&#1083;&#1080; &#1074; ListStroe &#1073;&#1091;&#1076;&#1077;&#1090; &#1095;&#1090;&#1086; &#1090;&#1086; &#1084;&#1077;&#1085;&#1103;&#1090;&#1089;&#1103; &#1090;&#1086;
&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1087;&#1088;&#1077;&#1088;&#1077;&#1088;&#1080;&#1089;&#1091;&#1102;&#1090;&#1089;&#1103;. &#1045;&#1089;&#1083;&#1080; &#1084;&#1077;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1073;&#1091;&#1076;&#1077;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1086; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1084; &#1074; &#1083;&#1080;&#1089;&#1090;&#1086;&#1088;
&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1077; &#1090;&#1086; treeview &#1084;&#1086;&#1078;&#1077;&#1090; &#1085;&#1077; &#1087;&#1077;&#1088;&#1077;&#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1090;&#1100;.

&#1058;&#1086; &#1077;&#1089;&#1090;&#1100; &#1077;&#1097;&#1077; &#1088;&#1072;&#1079; &#1093;&#1086;&#1095;&#1091; &#1095;&#1090;&#1086; &#1073;&#1099; &#1090;&#1099; &#1087;&#1086;&#1085;&#1103;&#1083; &#1082;&#1086;&#1083;&#1086;&#1085;&#1082;&#1080; &#1074; treeView &#1089; &#1082;&#1086;&#1083;&#1086;&#1085;&#1082;&#1072;&#1084;&#1080;, &#1074;
&#1076;&#1072;&#1085;&#1085;&#1099;&#1093; ListStore, &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1085;&#1080;&#1082;&#1072;&#1082; &#1085;&#1077; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1099;. &#1069;&#1090;&#1086;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1086;&#1085;&#1080; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1099;
&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1095;&#1077;&#1088;&#1077;&#1079; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102; StatusCellDataFuc, &#1086;&#1085;&#1072; &#1079;&#1085;&#1072;&#1077;&#1090; &#1074; &#1082;&#1072;&#1082;&#1091;&#1102; &#1082;&#1086;&#1083;&#1086;&#1085;&#1082;&#1091; ListStore
&#1083;&#1077;&#1079;&#1090;&#1100;, &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1088;&#1072;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1080;&#1079; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1076;&#1083;&#1103; &#1092;&#1086;&#1088;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1076;&#1085;&#1086;&#1081; &#1103;&#1095;&#1077;&#1081;&#1082;&#1080;. &#1052;&#1086;&#1078;&#1077;&#1090;
&#1074;&#1086;&#1086;&#1073;&#1097;&#1077; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1085;&#1077; &#1073;&#1088;&#1072;&#1090;&#1100;.

&#1040; &#1074; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1084;&#1099; &#1095;&#1077;&#1088;&#1077;&#1079; &#1072;&#1090;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1079;&#1072;&#1076;&#1072;&#1074;&#1072;&#1083;&#1080;, cell &#1088;&#1077;&#1085;&#1076;&#1077;&#1088;&#1091;, &#1082;&#1091;&#1076;&#1072; &#1083;&#1077;&#1079;&#1076;&#1090;&#1100; &#1074;
&#1084;&#1086;&#1076;&#1077;&#1083;&#1100; &#1095;&#1090;&#1086; &#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1086;&#1074; text, &#1082;&#1091;&#1076;&#1072; &#1083;&#1077;&#1079;&#1090;&#1100; &#1095;&#1090;&#1086; &#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; value &#1080; &#1090;&#1072;&#1082;
&#1076;&#1072;&#1083;&#1077;&#1077;.

&#1052;&#1086;&#1078;&#1077;&#1096;&#1100; &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1082;&#1072;&#1082; &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1074;&#1086;&#1090; &#1090;&#1091;&#1090; &#1074; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077;. &#1059;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1089;&#1090;&#1103;
&#1094;&#1074;&#1077;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1103;&#1095;&#1077;&#1081;&#1082;&#1080;
<A HREF="https://github.com/QualitySolution/Bazar/blob/master/newaprashka/MainWinAccrual.cs#L329">https://github.com/QualitySolution/Bazar/blob/master/newaprashka/MainWinAccrual.cs#L329</A>
&#1055;&#1088;&#1086;&#1089;&#1090;&#1086; &#1080;&#1089;&#1093;&#1086;&#1076;&#1103; &#1080;&#1079; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1095;&#1080;&#1089;&#1083;&#1072;.



--
View this message in context: <A HREF="http://mono.1490590.n4.nabble.com/progressbar-on-a-treeview-tp4667178p4667185.html">http://mono.1490590.n4.nabble.com/progressbar-on-a-treeview-tp4667178p4667185.html</A>
Sent from the Mono - Gtk# mailing list archive at Nabble.com.
</PRE>


<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="011556.html">[Gtk-sharp-list] progressbar on a treeview
</A></li>
	<LI>Next message: <A HREF="011558.html">[Gtk-sharp-list] progressbar on a treeview
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#11557">[ date ]</a>
              <a href="thread.html#11557">[ thread ]</a>
              <a href="subject.html#11557">[ subject ]</a>
              <a href="author.html#11557">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="http://lists.ximian.com/mailman/listinfo/gtk-sharp-list">More information about the Gtk-sharp-list
mailing list</a><br>
</body></html>
