<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [Gtk-sharp-list] progressbar on a treeview
   </TITLE>
   <LINK REL="Index" HREF="index.html" >
   <LINK REL="made" HREF="mailto:gtk-sharp-list%40lists.ximian.com?Subject=Re%3A%20%5BGtk-sharp-list%5D%20progressbar%20on%20a%20treeview&In-Reply-To=%3C1450423203399-4667182.post%40n4.nabble.com%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="011553.html">
   <LINK REL="Next"  HREF="011555.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Gtk-sharp-list] progressbar on a treeview</H1>
    <B>Andrey Gankov</B> 
    <A HREF="mailto:gtk-sharp-list%40lists.ximian.com?Subject=Re%3A%20%5BGtk-sharp-list%5D%20progressbar%20on%20a%20treeview&In-Reply-To=%3C1450423203399-4667182.post%40n4.nabble.com%3E"
       TITLE="[Gtk-sharp-list] progressbar on a treeview">gankov.andrey at inbox.ru
       </A><BR>
    <I>Fri Dec 18 07:20:03 UTC 2015</I>
    <P><UL>
        <LI>Previous message: <A HREF="011553.html">[Gtk-sharp-list] progressbar on a treeview
</A></li>
        <LI>Next message: <A HREF="011555.html">[Gtk-sharp-list] progressbar on a treeview
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#11554">[ date ]</a>
              <a href="thread.html#11554">[ thread ]</a>
              <a href="subject.html#11554">[ subject ]</a>
              <a href="author.html#11554">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>&#1071; &#1085;&#1077; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1102; &#1095;&#1090;&#1086; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090; &quot;&#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&quot;. &#1058;&#1099; &#1095;&#1080;&#1090;&#1072;&#1083; &#1089;&#1090;&#1072;&#1090;&#1100;&#1102; &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1103; &#1076;&#1072;&#1083;
&#1090;&#1077;&#1073;&#1077; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091;. &#1058;&#1072;&#1084; &#1088;&#1072;&#1089;&#1087;&#1080;&#1089;&#1072;&#1085;&#1072; &#1089;&#1072;&#1084;&#1072; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1072; Treeview. &#1052;&#1085;&#1077; &#1082;&#1072;&#1078;&#1077;&#1090;&#1089;&#1103; &#1090;&#1099; &#1077;&#1077; &#1085;&#1077;
&#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1077;&#1096;&#1100; &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1079;&#1072;&#1076;&#1072;&#1077;&#1096;&#1100; &#1085;&#1077;&#1082;&#1086;&#1088;&#1088;&#1077;&#1082;&#1090;&#1085;&#1099;&#1081; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;.

&#1057;&#1072;&#1084; Treeview &#1085;&#1077; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090; &#1085;&#1080;&#1082;&#1072;&#1082;&#1080;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1087;&#1086;&#1091;&#1095;&#1080;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084; &#1095;&#1077;&#1088;&#1077;&#1079;
&#1085;&#1077;&#1075;&#1086; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;. &#1054;&#1085; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090; &#1082;&#1086;&#1083;&#1086;&#1085;&#1082;&#1091;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1084;&#1086;&#1078;&#1085;&#1086; &#1095;&#1090;&#1086; &#1090;&#1086; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1080;
cellRenderer &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1086;&#1076;&#1085;&#1086;&#1081; &#1082;&#1086;&#1083;&#1086;&#1085;&#1082;&#1077;. cellRenderer
&#1079;&#1085;&#1072;&#1077;&#1090; &#1082;&#1072;&#1082; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1090;&#1100; &#1103;&#1095;&#1077;&#1081;&#1082;&#1091;, &#1085;&#1086; &#1085;&#1077; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1101;&#1090;&#1086; &#1086;&#1076;&#1080;&#1085; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1085;&#1072; &#1074;&#1089;&#1102;
&#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091;. &#1055;&#1086; &#1089;&#1091;&#1090;&#1080; treeview &#1082;&#1086;&#1075;&#1076;&#1072; &#1093;&#1086;&#1095;&#1077;&#1090; &#1085;&#1072;&#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1090;&#1100; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1091;&#1102; &#1103;&#1095;&#1077;&#1082;&#1091;, &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090;
cellRenderer-&#1091; &#1085;&#1072;&#1088;&#1080;&#1089;&#1091;&#1081; &#1084;&#1085;&#1077; &#1103;&#1094;&#1077;&#1081;&#1082;&#1091; &#1076;&#1083;&#1103; &#1101;&#1090;&#1086;&#1081; &#1057;&#1058;&#1056;&#1054;&#1050;&#1048;, &#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090; iter &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;.
&#1054;&#1073;&#1088;&#1072;&#1097;&#1072;&#1102; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091;. &#1055;&#1086;&#1090;&#1086;&#1084;&#1091; &#1082;&#1072;&#1082; cellRenderer &#1085;&#1077;
&#1088;&#1080;&#1089;&#1091;&#1077;&#1090; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1091;&#1102; &#1103;&#1095;&#1077;&#1081;&#1082;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1090;&#1072;&#1082;&#1086;&#1075;&#1086; &#1087;&#1086;&#1085;&#1103;&#1090;&#1080;&#1103; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1085;&#1077;&#1090;.

&#1044;&#1072;&#1085;&#1085;&#1099;&#1077; &#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1089;&#1103; &#1074; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1074; ListStore. &#1045;&#1089;&#1083;&#1080; &#1085;&#1091;&#1078;&#1085;&#1086; &#1087;&#1086;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;,
&#1084;&#1077;&#1096;&#1072;&#1077;&#1096;&#1100; &#1080;&#1093;, treeview &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1087;&#1077;&#1088;&#1077;&#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1090;&#1100;.

&#1055;&#1086;&#1082;&#1072;&#1078;&#1080; &#1089;&#1074;&#1086;&#1081; &#1082;&#1086;&#1076;, &#1076;&#1091;&#1084;&#1072;&#1102; &#1090;&#1072;&#1082; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1086;&#1097;&#1077; &#1087;&#1086;&#1085;&#1103;&#1090;, &#1095;&#1090;&#1086; &#1091; &#1090;&#1077;&#1073;&#1103; &#1085;&#1077; &#1082;&#1083;&#1077;&#1080;&#1090;&#1089;&#1103;.
gtk.aplication. invoke, &#1074;&#1086;&#1086;&#1073;&#1097;&#1077; &#1085;&#1077; &#1087;&#1088;&#1080;&#1095;&#1077;&#1084; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100;.



--
View this message in context: <A HREF="http://mono.1490590.n4.nabble.com/progressbar-on-a-treeview-tp4667178p4667182.html">http://mono.1490590.n4.nabble.com/progressbar-on-a-treeview-tp4667178p4667182.html</A>
Sent from the Mono - Gtk# mailing list archive at Nabble.com.
</PRE>


<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="011553.html">[Gtk-sharp-list] progressbar on a treeview
</A></li>
	<LI>Next message: <A HREF="011555.html">[Gtk-sharp-list] progressbar on a treeview
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#11554">[ date ]</a>
              <a href="thread.html#11554">[ thread ]</a>
              <a href="subject.html#11554">[ subject ]</a>
              <a href="author.html#11554">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="http://lists.ximian.com/mailman/listinfo/gtk-sharp-list">More information about the Gtk-sharp-list
mailing list</a><br>
</body></html>
