<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [Gtk-sharp-list] progressbar on a treeview
   </TITLE>
   <LINK REL="Index" HREF="index.html" >
   <LINK REL="made" HREF="mailto:gtk-sharp-list%40lists.ximian.com?Subject=Re%3A%20%5BGtk-sharp-list%5D%20progressbar%20on%20a%20treeview&In-Reply-To=%3C1450444700920-4667189.post%40n4.nabble.com%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="011560.html">
   <LINK REL="Next"  HREF="011562.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Gtk-sharp-list] progressbar on a treeview</H1>
    <B>Andrey Gankov</B> 
    <A HREF="mailto:gtk-sharp-list%40lists.ximian.com?Subject=Re%3A%20%5BGtk-sharp-list%5D%20progressbar%20on%20a%20treeview&In-Reply-To=%3C1450444700920-4667189.post%40n4.nabble.com%3E"
       TITLE="[Gtk-sharp-list] progressbar on a treeview">gankov.andrey at inbox.ru
       </A><BR>
    <I>Fri Dec 18 13:18:20 UTC 2015</I>
    <P><UL>
        <LI>Previous message: <A HREF="011560.html">[Gtk-sharp-list] progressbar on a treeview
</A></li>
        <LI>Next message: <A HREF="011562.html">[Gtk-sharp-list] GTK# Ubuntu - Debian question
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#11561">[ date ]</a>
              <a href="thread.html#11561">[ thread ]</a>
              <a href="subject.html#11561">[ subject ]</a>
              <a href="author.html#11561">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>nast90210 wrote
&gt;<i> &#1061;&#1086;&#1090;&#1077;&#1083;&#1086;&#1089;&#1100; &#1073;&#1099; &#1086;&#1090;&#1084;&#1077;&#1090;&#1080;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1086;&#1095;&#1077;&#1085;&#1100; &#1089;&#1090;&#1088;&#1072;&#1085;&#1085;&#1099;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1082;&#1086;&#1089;&#1090;&#1099;&#1083;&#1080; &#1074; gtk# - &#1103;
</I>&gt;<i> &#1085;&#1077;&#1076;&#1072;&#1074;&#1085;&#1086; &#1085;&#1072;&#1095;&#1072;&#1083; &#1089; &#1085;&#1080;&#1084; &#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1080;&#1090;&#1100;&#1089;&#1103;.
</I>
&#1042; &#1090;&#1086;&#1084; &#1090;&#1086; &#1080; &#1076;&#1077;&#1083;&#1086;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1086; &#1085;&#1077; &#1082;&#1086;&#1089;&#1090;&#1099;&#1083;&#1080;. &#1053;&#1072; &#1089;&#1072;&#1084;&#1086; &#1076;&#1077;&#1083;&#1077; &#1101;&#1090;&#1086; &#1086;&#1095;&#1077;&#1085;&#1100; &#1075;&#1080;&#1073;&#1082;&#1080;&#1081; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;,
&#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1086;&#1095;&#1077;&#1085;&#1100; &#1084;&#1085;&#1086;&#1075;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100;, &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1080; &#1091;&#1076;&#1086;&#1073;&#1085;&#1086; &#1074; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1093; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103;&#1093;. &#1053;&#1086; &#1089;
&#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1088;&#1072;&#1079;&#1072; &#1085;&#1077; &#1087;&#1086;&#1085;&#1103;&#1090;&#1077;&#1085;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1082;&#1072;&#1082; &#1074; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;, &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;
&#1084;&#1077;&#1085;&#1077;&#1077; &#1075;&#1080;&#1073;&#1082;&#1080;&#1081;, &#1072; &#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1080; &#1090;&#1091;&#1087;&#1086;&#1081;. &#1053;&#1091;&#1090; &#1080;&#1079;&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086;
&#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1090;&#1076;&#1077;&#1083;&#1077;&#1085;&#1086; &#1086;&#1090; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.

&#1050;&#1086;&#1089;&#1090;&#1099;&#1083;&#1100; &#1090;&#1091;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1086;&#1076;&#1085;&#1086;&#1084;. &#1042;&#1089;&#1103; &#1101;&#1090;&#1072; &#1096;&#1090;&#1091;&#1082;&#1072; &#1079;&#1072;&#1090;&#1086;&#1095;&#1077;&#1085;&#1072; &#1087;&#1086;&#1076; &#1057;, &#1085;&#1072;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081; &#1076;&#1083;&#1103; gtk,
&#1072; gtk# &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1085;&#1077; &#1074;&#1085;&#1086;&#1089;&#1080;&#1090; &#1091;&#1076;&#1086;&#1073;&#1089;&#1090;&#1074; &#1087;&#1088;&#1080;&#1089;&#1091;&#1097;&#1080;&#1093; &#1103;&#1079;&#1099;&#1082;&#1091; C#, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1087;&#1088;&#1080;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103;
&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1089; &#1101;&#1090;&#1080;&#1084; &#1074;&#1080;&#1076;&#1078;&#1077;&#1090;&#1086;&#1084; &#1087;&#1086;&#1095;&#1090;&#1080; &#1090;&#1072;&#1082; &#1078;&#1077; &#1082;&#1072;&#1082; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089; &#1085;&#1080;&#1084; &#1074;&#1077;&#1076;&#1077;&#1090;&#1089;&#1103; &#1080;&#1079; C, &#1089;
&#1077;&#1075;&#1086;(&#1103;&#1079;&#1099;&#1082;&#1072;) &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;. &#1063;&#1090;&#1086; &#1103; &#1080;&#1084;&#1077;&#1102; &#1074;&#1074;&#1080;&#1076;&#1091;, &#1074;&#1086; &#1087;&#1077;&#1088;&#1074;&#1099;&#1093; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089; ListStore
&#1085;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1089;&#1083;&#1086;&#1078;&#1085;&#1077;&#1077; &#1095;&#1077;&#1084; &#1089; &#1085;&#1072;&#1090;&#1080;&#1074;&#1085;&#1099;&#1084;&#1080; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072;&#1084;&#1080; &#1080; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; &#1080;&#1079; C#, &#1074;&#1084;&#1077;&#1089;&#1090;&#1086;
&#1101;&#1090;&#1086;&#1075;&#1086; &#1089;&#1090;&#1088;&#1072;&#1085;&#1085;&#1099;&#1077; &#1080;&#1090;&#1077;&#1088;&#1099;, &#1080; &#1085;&#1077;&#1091;&#1076;&#1086;&#1073;&#1085;&#1086;&#1077; &#1086;&#1073;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1077;.

&#1045;&#1089;&#1083;&#1080; &#1087;&#1083;&#1072;&#1085;&#1080;&#1088;&#1091;&#1077;&#1096;&#1100; &#1084;&#1085;&#1086;&#1075;&#1086; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100; &#1087;&#1086;&#1076; GTK#, &#1090;&#1086; &#1084;&#1099; &#1085;&#1072;&#1095;&#1072;&#1083;&#1080; &#1095;&#1072;&#1089;&#1090;&#1080;&#1095;&#1085;&#1086; &#1088;&#1077;&#1096;&#1072;&#1090;&#1100;
&#1101;&#1090;&#1091; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1091; &#1074; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080; <A HREF="https://github.com/QualitySolution/GammaBinding">https://github.com/QualitySolution/GammaBinding</A>
&#1052;&#1086;&#1078;&#1077;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1086; &#1080; &#1087;&#1086;&#1091;&#1095;&#1072;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100;.
&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1077; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1091;&#1076;&#1086;&#1073;&#1085;&#1099;&#1081; &#1073;&#1080;&#1085;&#1076;&#1080;&#1085;&#1075; GTK &#1074;&#1080;&#1076;&#1078;&#1077;&#1090;&#1086;&#1074; &#1085;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; C#, &#1072;
&#1076;&#1083;&#1103; treeView &#1095;&#1072;&#1089;&#1090;&#1080;&#1095;&#1085;&#1086; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085; &#1073;&#1080;&#1085;&#1076;&#1080;&#1085;&#1075;&#1072; &#1085;&#1072; &#1085;&#1072;&#1090;&#1080;&#1074;&#1085;&#1099;&#1077; &#1089;&#1087;&#1080;&#1089;&#1082;&#1080; C#, &#1076;&#1083;&#1103; &#1091;&#1076;&#1086;&#1073;&#1085;&#1086;&#1081;
&#1088;&#1072;&#1073;&#1086;&#1090;&#1099;.
&#1053;&#1086; &#1101;&#1090;&#1086; &#1077;&#1097;&#1077; &#1089;&#1086;&#1074;&#1089;&#1077;&#1084; &#1072;&#1083;&#1100;&#1092;&#1072;. &#1055;&#1080;&#1096;&#1077;&#1084; &#1087;&#1072;&#1088;&#1072;&#1083;&#1083;&#1077;&#1083;&#1100;&#1085;&#1086;, &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1086; &#1095;&#1090;&#1086; &#1085;&#1072;&#1076;&#1086; &#1076;&#1083;&#1103; &#1089;&#1074;&#1086;&#1080;&#1093;
&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099;&#1083;&#1100;&#1077;&#1090;&#1089;&#1103; &#1074;&#1086; &#1095;&#1090;&#1086;-&#1090;&#1086; &#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1077; &#1073;&#1091;&#1076;&#1077;&#1084; &#1087;&#1088;&#1086;&#1076;&#1074;&#1080;&#1075;&#1072;&#1090;&#1100;. &#1040;&#1085;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074; &#1074;&#1089;&#1077;
&#1088;&#1072;&#1074;&#1085;&#1086; &#1088;&#1072;&#1073;&#1086;&#1095;&#1080;&#1093; &#1085;&#1077;&#1090;.



--
View this message in context: <A HREF="http://mono.1490590.n4.nabble.com/progressbar-on-a-treeview-tp4667178p4667189.html">http://mono.1490590.n4.nabble.com/progressbar-on-a-treeview-tp4667178p4667189.html</A>
Sent from the Mono - Gtk# mailing list archive at Nabble.com.
</PRE>


<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="011560.html">[Gtk-sharp-list] progressbar on a treeview
</A></li>
	<LI>Next message: <A HREF="011562.html">[Gtk-sharp-list] GTK# Ubuntu - Debian question
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#11561">[ date ]</a>
              <a href="thread.html#11561">[ thread ]</a>
              <a href="subject.html#11561">[ subject ]</a>
              <a href="author.html#11561">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="http://lists.ximian.com/mailman/listinfo/gtk-sharp-list">More information about the Gtk-sharp-list
mailing list</a><br>
</body></html>
