<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
 <HEAD>
   <TITLE> [Mono-list] error install mcs - tar
   </TITLE>
   <LINK REL="Index" HREF="index.html" >
   <LINK REL="made" HREF="mailto:mono-list%40lists.ximian.com?Subject=%5BMono-list%5D%20error%20install%20mcs%20-%20tar&In-Reply-To=">
   <META NAME="robots" CONTENT="index,nofollow">
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="028865.html">
   <LINK REL="Next"  HREF="028868.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Mono-list] error install mcs - tar</H1>
    <B>Monroy Rodriguez Elizabeth</B> 
    <A HREF="mailto:mono-list%40lists.ximian.com?Subject=%5BMono-list%5D%20error%20install%20mcs%20-%20tar&In-Reply-To="
       TITLE="[Mono-list] error install mcs - tar">emonroro at banrep.gov.co
       </A><BR>
    <I>Mon Oct  3 17:00:19 EDT 2005</I>
    <P><UL>
        <LI>Previous message: <A HREF="028865.html">[Mono-list] Re: Building rpms on FC4: typo in spec file?
</A></li>
        <LI>Next message: <A HREF="028868.html">[Mono-list] Re: error install mcs - tar
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#28866">[ date ]</a>
              <a href="thread.html#28866">[ thread ]</a>
              <a href="subject.html#28866">[ subject ]</a>
              <a href="author.html#28866">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>An embedded message was scrubbed...
From: &quot;Monroy Rodriguez Elizabeth&quot; &lt;<A HREF="http://lists.ximian.com/mailman/listinfo/mono-list">emonroro at banrep.gov.co</A>&gt;
Subject: error install mcs - tar
Date: Mon, 3 Oct 2005 16:00:19 -0500
Size: 7383
Url: <A HREF="http://lists.ximian.com/pipermail/mono-list/attachments/20051003/b1354554/originalmail.eml">http://lists.ximian.com/pipermail/mono-list/attachments/20051003/b1354554/originalmail.eml</A>
-------------- next part --------------
AVISO LEGAL:
-- Las opiniones que contenga este mensaje son exclusivas de su autor y no necesariamente representan la opini&#243;n oficial del Banco de la Rep&#250;blica o de sus autoridades.
-- El receptor deber&#225; verificar posibles virus inform&#225;ticos que tenga el correo o cualquier anexo a &#233;l, raz&#243;n por la cual el Banco de la Rep&#250;blica no aceptar&#225; responsabilidad alguna por da&#241;os causados por cualquier virus transmitido en este correo.
-- La informaci&#243;n contenida en este mensaje y en los archivos electr&#243;nicos adjuntos es confidencial y reservada, conforme a lo previsto en la Constituci&#243;n y en la Ley del Banco de la Rep&#250;blica, y est&#225; dirigida exclusivamente a su destinatario, sin la intenci&#243;n de que sea revelada o divulgada a otras personas. El acceso al contenido de esta comunicaci&#243;n por cualquier otra persona diferente al destinatario no est&#225; autorizado por el Banco de la Rep&#250;blica y est&#225; sancionado de acuerdo con las normas legales aplicables.
-------------- next part --------------
-- El que il&#237;citamente sustraiga, oculte, extrav&#237;e, destruya, intercepte, controle o impida esta comunicaci&#243;n, antes de que llegue a su destinatario, estar&#225; sujeto a las sanciones penales correspondientes. Igualmente, incurrir&#225; en sanciones penales el que, en provecho propio o ajeno o con perjuicio de otro, divulgue o emplee la informaci&#243;n contenida en esta comunicaci&#243;n. En particular, los servidores p&#250;blicos que reciban este mensaje est&#225;n obligados a asegurar y mantener la confidencialidad de la informaci&#243;n en &#233;l contenida y, en general, a cumplir con los deberes de custodia, cuidado, manejo y dem&#225;s previstos en el r&#233;gimen disciplinario.
-- Si por error recibe este mensaje, le solicitamos enviarlo de vuelta al Banco de la Rep&#250;blica a la direcci&#243;n de correo electr&#243;nico que se lo envi&#243; y borrarlo de sus archivos electr&#243;nicos o destruirlo.
-------------- next part --------------
LEGAL NOTICE:
-- Any opinions contained in this message are exclusive of its author and not necessarily represent the official position of Banco de la Rep&#250;blica or of its authorities.
-- The recipient must verify the presence of possible informatic viruses in the mail or in any annex thereto, and for this reason Banco de la Rep&#250;blica shall not be made liable for any damages caused by viruses transmitted hereby
-- The information contained in this message and in any electronic files annexed thereto is confidential and privileged, as per the Colombian Constitution and the Law that governs Banco de la Rep&#250;blica, and is directed exclusively to its addressee, with no intention of it being disclosed or revealed to third parties. The access to the content of this communication by any person different from its addressee is not authorized by Banco de la Rep&#250;blica and shall be penalized in accordance with the applicable legal dispositions.
-------------- next part --------------
-- Any person who illicitly removes, hides, distracts, destroys, intercepts, controls, or otherwise prevents this communication from arriving to its addressee, shall be subject to the appropriate criminal penalties. Likewise, criminal penalties shall be incurred by any who, either for his/her own benefit or on behalf of third parties, or with prejudice of a third party, discloses or employs the information contained in this communication. In particular, public servants that may receive this message shall be obliged to ensure and keep the confidentiality of the information contained therein and, in general, to comply with the duties of custody, care, handling and other provided under the disciplinary regime.
-- If you should happen to receive this message by mistake, please send it back to Banco de la Rep&#250;blica to the same e-mail address and either delete it from your electronic files or destroy it.
</PRE>





<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="028865.html">[Mono-list] Re: Building rpms on FC4: typo in spec file?
</A></li>
	<LI>Next message: <A HREF="028868.html">[Mono-list] Re: error install mcs - tar
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#28866">[ date ]</a>
              <a href="thread.html#28866">[ thread ]</a>
              <a href="subject.html#28866">[ subject ]</a>
              <a href="author.html#28866">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="http://lists.ximian.com/mailman/listinfo/mono-list">More information about the Mono-list
mailing list</a><br>
</body></html>
